import object1 from "../../assets/object1.png";
import object2 from "../../assets/object2.png";
import object3 from "../../assets/object3.png";
import object4 from "../../assets/object4.png";
import object5 from "../../assets/object5.png";
import object6 from "../../assets/object6.png";
import object7 from "../../assets/object7.png";
import object8 from "../../assets/object8.png";
import object9 from "../../assets/object9.png";
import object10 from "../../assets/object10.png";
import object11 from "../../assets/object11.png";
import object12 from "../../assets/object12.png";
import object13 from "../../assets/object13.png";
import object14 from "../../assets/object14.png";
import object15 from "../../assets/object15.png";
import object16 from "../../assets/object16.png";
import object17 from "../../assets/object17.png";
import object18 from "../../assets/object18.png";
import object19 from "../../assets/object19.png";
import object20 from "../../assets/object20.png";
import object21 from "../../assets/object21.png";
import object22 from "../../assets/object22.png";
import object23 from "../../assets/object23.png";

export type ItemObject={
  title?:string,
  desc?:string,
  image?:string,
  price?:string,
  status?:string,
  contracts?:string[],
  commonPrice?:string,
  author?:string,
  timeWork?:string
}

export const objects:ItemObject[] = [
  {
    title: "Объект военно-промышленного комплекса и гособоронзаказа",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ здания производственного цеха",
    image: object1,
    author: "ФКП «Пермский пороховой завод»",
    price: "460 млн. руб.",
    status: "окончание 2 квартал 2024 года",
  },
  {
    title: "Объект военно-промышленного комплекса и гособоронзаказа",
    desc: "СТРОИТЕЛЬСТВО НОВОГО ЗДАНИЯ ХРАНЕНИЯ ТЕХНОЛОГИЧЕСКИХ ОТХОДОВ",
    image: object1,
    author: "ФКП «Пермский пороховой завод»",
    price: "460 млн. руб.",
    status: "окончание 2 квартал 2024 года",
  },

  {
    title: "Объект на новых территориях РФ",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ ЗДАНИЯ ИМУЩЕСТВЕННОГО КОМПЛЕКСА АКИМОВСКОЙ ЦРБ",
    image: object2,
    author: "Министерство Здравоохранения Запорожской области",
    price: "165 млн. руб.",
    status: "исполнен в 2023 году",
    timeWork: "менее 3-х месяцев",
  },
  {
    title: "Объект на новых территориях РФ",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ АДМИНИСТРАТИВНОГО ЗДАНИЯ ДЛЯ НУЖД МИНИСТЕРСТВА ЗДРАВООХРАНЕНИЯ",
    image: object3,
    author: "Министерство Здравоохранения Запорожской области",
    price: "165 млн. руб.",
    status: "исполнен в 2023 году",
    timeWork: "менее 3-х месяцев",
  },
  {
    title: "Объект здравоохранения (Минздрав Республики Крым)",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ ДИАГНОСТИЧЕСКОГО ЦЕНТРА  ГБУЗ РК «РКБ ИМ. Н. А. СЕМАШКО» Г. СИМФЕРОПОЛЬ, УЛ. СЕМАШКО, 8",
    image: object4,
    author:
      "Государственное бюджетное учреждение здравоохранения Республики Крым «Руспубликанская клиническая больница им. Н.А. Семашко»",

    status: "исполнен в 2018 году",
  },
  {
    title: "Объект здравоохранения (Минздрав Республики Крым)",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ ЗДАНИЯ ПОЛИКЛИНИКИ ГБУЗ РК «СИМФЕРОПОЛЬСКАЯ ГКБ№7» УЛ. 60 ЛЕТ ОКТЯБРЯ, 30",
    image: object5,
    status: "исполнен в 2018 году",
  },
  {
    title: "Объект здравоохранения (Минздрав Республики Крым)",
    desc: "КГБУЗ РК «СИМФЕРОПОЛЬСКАЯ ГКБ№7» УЛ. 60 ЛЕТ ОКТЯБРЯ, 30",
    image: object6,
    contracts: [
      "Капитальный ремонт паталогоанатомического отделения",
      "Капитальный ремонт благоустройства территории",
      "Капитальный ремонт благоустройства территории инфекционного корпуса",
    ],
    commonPrice: "более 200 млн руб",
  },
  {
    title: "Объект здравоохранения (Минздрав Республики Крым)",
    desc: "ГБУЗ РК «Первомайская ЦРБ»",
    image: object7,
    contracts: ["Капитальный ремонт акушерско- гинекологического корпуса"],
    price: "489 214 371 руб.",
    status: "завершение 4 квартал 2023 года",
  },
  {
    title: "Объект здравоохранения (Минздрав Республики Крым)",
    desc: "ГБУЗ РК «Керченская № 1 имени Н. И. Пирогова»",
    image: object8,
    contracts: [
      "Капитальный ремонт систем вентиляции зданий поликлиники и здания отделения урологии",
    ],
    status: "завершение 3 квартал 2023 года",
  },
  {
    title: "Объект здравоохранения (Севастополь)",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ ЗДАНИЯ СТАЦИОНАРА «ГОРОДСКАЯ БОЛЬНИЦА № 6» Г. ИНКЕРМАН",
    image: object9,
    author: "«ГБУ Здравоохранения Севастополя» «Городская больница № 6»",
    status: "исполнен в 2019 году",
  },
   {
    title: "Объект образования (Министерство образования Пермского края)",
    desc: "СТРОИТЕЛЬСТВО ШКОЛЫ НА 220 МЕСТ (3500 м2) С МЕЖШКОЛЬНЫМ СТАДИОНОМ СЕЛО БОЛЬШАЯ КОЧА, ПЕРМСКИЙ КРАЙ",
    image: object10,
    status: "исполнен в 2015 году",
  },
   {
    title: "Объект образования (Министерство образования Пермского края)",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ Средней Общеобразовательной Школы №6 ПЕРМЬ, ФЕДОСЕЕВА ,16",
    image: object11,
    status: "исполнен в 2012 году",
  },{
    title: "Объект образования (Министерство образования Пермского края)",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ СОШ  с углубленным изучением немецкого языка №12 ПЕРМЬ, ЮРИЯ СМИРНОВА ,106",
    image: object12,
    status: "исполнен в 2014 году",
  },
  {
    title: "Объект образования (Министерство образования Пермского края)",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ СОШ №10 ПЕРМЬ, ЧКАЛОВА,48",
    image: object13,
    status: "исполнен в 2014 году",
  },
  {
    title: "Объект образования (Министерство образования Пермского края)",
    desc: "СТРОИТЕЛЬСТВО ЗДАНИЯ ДЕТСКОГО САДА НА 90 МЕСТ с. КОЧЕВО, ПЕРМСКИЙ КРАЙ",
    image: object14,
    status: "исполнен в 2014 году",
  },
  {
    title: "Объект спорта (Минспорт Республики Крым)",
    desc: "РЕКОНСТРУКЦИЯ ПЛОСКОСТНОГО СПОРТИВНОГО СООРУЖЕНИЯ СТАДИОН. СИМФЕРОПОЛЬСКИЙ РАЙОН, ПГТ. ГВАРДЕЙСКОЕ, УЛ. ОСТРЯКОВА, 30",
    image: object15,
  },
   {
    title: "Объект спорта (Севастополь)",
    desc: "Строительство Физкультурно- Оздоровительного Комплекса с залом для борьбы Севастополь, ул Гавена 6а",
    image: object16,
  },
   {
    title: "Строительство Физкультурно- Оздоровительного Комплекса с залом для борьбы Севастополь, ул Гавена 6а",
    desc: "СТРОИТЕЛЬСТВО ЗДАНИЯ ФИЗКУЛЬТУРНО-ОЗДОРОВИТЕЛЬНОГО КОМПЛЕКСА с. КОЧЕВО, ПЕРМСКИЙ КРАЙ",
    image: object17,
  },
  {
    title: "Объект спорта (Министерство спорта Пермский край)",
    desc: "СТРОИТЕЛЬСТВО 5 ПЛОСКОСТНЫХ СООРУЖЕНИЙ (СТАДИОНЫ)  В СИВИНСКОМ, НЫТВЕНСКОМ, ВЕРЕЩАГИНСКОМ РАЙОНАХ И В Г. ПЕРМЬ",
    image: object18,
  },
   {
    title: "Административные объекты (Федеральная Налоговая Служба)",
    desc: "ВЫПОЛНЕНИЕ РАБОТ ПО КАПИТАЛЬНОМУ РЕМОНТУ АДМИНИСТРАТИВНОГО ЗДАНИЯ МЕЖРАЙОННОЙ ИФНС РОССИИ №1 СЕВАСТОПОЛЬ, УЛ. ГЕРОЕВ СЕВАСТОПОЛЯ 74",
    image: object19,
  },
   {
    title: "Административные объекты (Федеральная Налоговая Служба)",
    desc: "Капитальный ремонт административного здания в г. симферополь",
    image: object20,
  },
   {
    title: "Объекты Министерства Внутренних Дел Пермского края",
    desc: "СТРОИТЕЛЬСТВО ЗДАНИЯ ИВС ДЛЯ МИНИСТЕРСТВА ВНУТРЕННИХ ДЕЛ ПЕРМСКОГО КРАЯ, Г. КУНГУР",
    image: object21,
  },
   {
    title: "Линейные объекты",
    desc: "КАПИТАЛЬНЫЙ РЕМОНТ СЕТЕЙ ВОДОСНАБЖЕНИЯ в Г. КРАСНОПЕРЕКОПСК",
    image: object22,
  },
   {
    title: "Объекты культурного наследия",
    desc: "Дворец Харакс дворец царской семьи 19 века (архитектор Краснов) Гаспра, Ялта",
    image: object23,
  },
];
